docs/wiley/modules/m14/contents.org
#+TITLE: Module 14 - Automatic Program Verification using Hoare Logic


#+HTML_HEAD: <link rel="stylesheet" href="https://dynaroars.github.io/files/org.css">

* Overview and Objectives 
** OVERVIEW 
In this module we will learn about automatic verification, which is a practical and real-world use of the specifications and reasonings --- topics that we have learned throughout the class.  We will start with the basic of logical reasoning and then  learn how to use verify program correctness with respect to given specifications and contracts).

** COURSE LEVEL OBJECTIVES (CLO) 
Upon completion of this course, you should be able to:

1. Construct modern high quality software systems and reason about them. 
2. Properly define software specifications and rep-invariants. 
3. Leverage immutability to properly construct threat safe programs. 
4. Explain object-oriented concepts such as information hiding, encapsulation, data and type abstraction, and polymorphism. 
5. Properly use exception handling 
6. Identify when it is appropriate to use inheritance and generics.  
 
** MODULE LEVEL OBJECTIVES (MLO) 
Upon completion of this module’s activities, you should be able to: 

1. explain and demonstrate basic logic terminologies and usage (CLO 1,2)
2. compare and describe key concepts and terminologies in automatic program verification (e.g., loop invariants, partial vs total correctness) (CLO 1,2)
3. Transform programs and specifications to logical formulae (CLO 1,2)
4. Construct requirements and setups for verficiation and verify program automatically using Hoare logic (CLO 1,2)

* Module Video (Wiley-Produced w/Dan Ramos) [3-5 minutes]
#+begin_comment
#+end_comment
  

* Learning Materials [~100 pages, ~3.5 hours]
** TEXTBOOK READINGS
- Hoare logic notes: https://nguyenthanhvuh.github.io/posts/program-analysis-notes.html#hoare
- Barbara Liskov with John Guttag. Program Development in Java. Addison Wesley, 2001, ISBN 0-201-65768-6. 
  - Chapter TODO
    
** DONE ADDITIONAL RESOURCES
CLOSED: [2022-09-29 Thu 10:43]
- Propositional logic: https://en.wikipedia.org/wiki/Propositional_calculus
- Hoare logic: https://en.wikipedia.org/wiki/Hoare_logic


* Introduction (MLO 1) [~15 mins]
- Previously we have look at program specifications that involve pre and post conditions and  *manually* reason that the program implementation is correct (adheres to) with respect to the specification.
- As we also have experienced, such manual reasoning is difficult, time consuming, and error-prone, even for short "toy" examples shown class.
- Automatic testing is popular and widely-used, however not adequate for many domains and situations such as avionic systems and medical systems 
- Automatic verification is what required, and has enjoyed many successes in the real-world. For examples,
  - Hardware (e.g., circuit designs, CPU) are rigorous verified by chip makers
  - Companies and government organizations develop and rely on verification tools (e.g., Mars Rover, Avionic system of Airbus, Facebook newsfeeds and instagrams, Microsoft drivers are all verified in some ways). 

- Today we will learn about Hoare Logic, one of the most popular ways to *automatically verify program correctness.
- Hoare logic:
  - a formal systems with a set of rules to formally reason about the correctness of a program with respect to given specifications
  - invited by Sir. Tony Hoare, who is the Turing award winner in 1980 , and in addition to Hoare logic, has developed many well-known concepts such as the *quicksort algorithm and "null pointer" (the billion dollar mistake) 
  - standard for many practical verification techniques and tools

For this topic, you will learn about
- Hoare tripple: which describes how the program changes its states during execution
- Total vs. Partial correctness: Total correctness reasons both about program termination (e.g., the loop will eventually terminate) and that the program is correct and satisfies the postcondition when it terminates; whereas parial correctness *assumes the program terminates and only deals with program correctness.
- Computing Weakenst Preconditions using Hoare rules: a set of rules for each types of statements in a program that leads to the weakest preconditions required for verification
- Finding and using Loop invariants: the crucial piece of information that the user needs to provide to enable verification automation under Hoare logic
- Formulating specifications, weakest preconditions, loop invariants as logical formulae
- Using SAT solver to automatically prove program correctness



* Intro to Logic (MLO 2) [~1 hour]
  
