docs/wiley/modules/m14/hoare/contents.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-29 Thu 12:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>Module 10 - Automatic Program Verification using Hoare Logic</title>
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://dynaroars.github.io/files/org.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Module 10 - Automatic Program Verification using Hoare Logic</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org296a855">1. Overview and Objectives</a>
<ul>
<li><a href="#org79723fd">1.1. <span class="todo TODO">TODO</span> OVERVIEW</a></li>
<li><a href="#org16b1d1a">1.2. COURSE LEVEL OBJECTIVES (CLO)</a></li>
<li><a href="#org875ab2b">1.3. MODULE LEVEL OBJECTIVES (MLO)</a></li>
</ul>
</li>
<li><a href="#org5c0996e">2. Module Video (Wiley-Produced w/Dan Ramos) [3-5 minutes]</a></li>
<li><a href="#orgf971a9b">3. Learning Materials [~100 pages, ~3.5 hours]</a>
<ul>
<li><a href="#org9cdeb4c">3.1. TEXTBOOK READINGS</a></li>
<li><a href="#org88e1737">3.2. <span class="done DONE">DONE</span> ADDITIONAL RESOURCES</a></li>
</ul>
</li>
<li><a href="#org45dae7a">4. Module 10 Learning Unit 0 – Motivation (MLO 1) [~15 mins]</a></li>
<li><a href="#orgc9cb43a">5. <span class="todo TODO">TODO</span> Module 10 Learning Unit 1 – Intro to Logic (MLO 2) [~1 hour]</a>
<ul>
<li><a href="#orgde5bddd">5.1. Terminology</a></li>
<li><a href="#orga679939">5.2. Important Concept: Formula evaluation</a></li>
<li><a href="#org47fe5dc">5.3. Instructor Screencast: TITLE</a></li>
<li><a href="#orgb4f167f">5.4. Interactive Element: TITLE</a></li>
<li><a href="#org7fb156d">5.5. Important Concept: Text</a></li>
<li><a href="#org944bb33">5.6. Instructor Screencast: TITLE</a></li>
<li><a href="#org381d961">5.7. Important Concept: Text</a></li>
</ul>
</li>
<li><a href="#org3d7d499">6. Module 10 Learning Unit 2 – Program Verification using Hoare logic (MLO 2, 3) [~3 hours]</a>
<ul>
<li><a href="#org029400a">6.1. Terminology</a>
<ul>
<li><a href="#orgc1c7010">6.1.1. Hoare Tripple <code>{P} S {Q}</code></a></li>
<li><a href="#org5efc9b8">6.1.2. Partial and Total Correctness</a></li>
<li><a href="#org5cdcc58">6.1.3. Examples of Hoare Tripples</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcc366ce">7. Important Concept: Text</a>
<ul>
<li><a href="#org9f81eaf">7.1. Rules to Computing Weakest Preconditions</a>
<ul>
<li><a href="#org0f7cff1">7.1.1. Quick summary of Hoare rules</a></li>
<li><a href="#org35fe055">7.1.2. ASSIGNMENT</a></li>
<li><a href="#list">7.1.3. LIST of statements</a></li>
<li><a href="#org1151d39">7.1.4. CONDITIONAL</a></li>
</ul>
</li>
<li><a href="#org5d7bb13">7.2. Important Concept: Loop Invariants</a>
<ul>
<li><a href="#org162e01a">7.2.1. Loop Invariants</a></li>
<li><a href="#org14a66bd">7.2.2. Where is the loop invariant <code>I</code>?</a></li>
<li><a href="#li">7.2.3. What is the loop invariant <code>I</code>?</a></li>
<li><a href="#li-to-use">7.2.4. Which loop invariants to use?</a></li>
<li><a href="#org897751f">7.2.5. Important Concept: Computing WP for LOOPs</a></li>
<li><a href="#org4083509">7.2.6. Instructor Screencast: TITLE</a></li>
<li><a href="#org6bda050">7.2.7. Interactive Element: TITLE</a></li>
<li><a href="#orgc198ab8">7.2.8. Important Concept: Text</a></li>
<li><a href="#org710e1c6">7.2.9. Instructor Screencast: TITLE</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd77001b">8. Module 10 Assignment – Program Verification using Hoare Logic (MLO TODO, TODO) [~2.5 hours]</a>
<ul>
<li><a href="#org7750487">8.1. Purpose</a></li>
<li><a href="#org6ee912d">8.2. Instructions</a>
<ul>
<li><a href="#org2ab1162">8.2.1. Q1</a></li>
<li><a href="#orgb304ad1">8.2.2. Q2</a></li>
</ul>
</li>
<li><a href="#org36e6a39">8.3. Deliverable</a></li>
<li><a href="#org3733707">8.4. Due Date</a></li>
</ul>
</li>
<li><a href="#orgbccdfde">9. Module 1 Quiz (MLO TODO, TODO, TODO) [~.5 hour]</a>
<ul>
<li><a href="#org1ad331e">9.1. Purpose</a></li>
<li><a href="#org317cd21">9.2. Instructions</a></li>
<li><a href="#org2538073">9.3. Deliverable</a></li>
<li><a href="#org67b1a27">9.4. Due Date</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org296a855" class="outline-2">
<h2 id="org296a855"><span class="section-number-2">1.</span> Overview and Objectives</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org79723fd" class="outline-3">
<h3 id="org79723fd"><span class="section-number-3">1.1.</span> <span class="todo TODO">TODO</span> OVERVIEW</h3>
</div>

<div id="outline-container-org16b1d1a" class="outline-3">
<h3 id="org16b1d1a"><span class="section-number-3">1.2.</span> COURSE LEVEL OBJECTIVES (CLO)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Upon completion of this course, you should be able to:
</p>

<ol class="org-ol">
<li>Construct modern high quality software systems and reason about them.</li>
<li>Properly define software specifications and rep-invariants.</li>
<li>Leverage immutability to properly construct threat safe programs.</li>
<li>Explain object-oriented concepts such as information hiding, encapsulation, data and type abstraction, and polymorphism.</li>
<li>Properly use exception handling</li>
<li>Identify when it is appropriate to use inheritance and generics.</li>
</ol>
</div>
</div>

<div id="outline-container-org875ab2b" class="outline-3">
<h3 id="org875ab2b"><span class="section-number-3">1.3.</span> MODULE LEVEL OBJECTIVES (MLO)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Upon completion of this module’s activities, you should be able to: 
</p>

<ol class="org-ol">
<li>Motivation for using verification to prove program correctness/safety specifications (CLO 1,2)</li>
<li>Able to formalize programs and specifications as logical formulae (CLO 1,2)</li>
<li>Able to automatically verify program automatically using Hoare logic (CLO 1,2)</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org5c0996e" class="outline-2">
<h2 id="org5c0996e"><span class="section-number-2">2.</span> Module Video (Wiley-Produced w/Dan Ramos) [3-5 minutes]</h2>
<div class="outline-text-2" id="text-2">
</div>
</div>





<div id="outline-container-orgf971a9b" class="outline-2">
<h2 id="orgf971a9b"><span class="section-number-2">3.</span> Learning Materials [~100 pages, ~3.5 hours]</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9cdeb4c" class="outline-3">
<h3 id="org9cdeb4c"><span class="section-number-3">3.1.</span> TEXTBOOK READINGS</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Hoare logic notes: <a href="https://nguyenthanhvuh.github.io/posts/program-analysis-notes.html#hoare">https://nguyenthanhvuh.github.io/posts/program-analysis-notes.html#hoare</a></li>
<li>Barbara Liskov with John Guttag. Program Development in Java. Addison Wesley, 2001, ISBN 0-201-65768-6. 
<ul class="org-ul">
<li>Chapter TODO</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org88e1737" class="outline-3">
<h3 id="org88e1737"><span class="section-number-3">3.2.</span> <span class="done DONE">DONE</span> ADDITIONAL RESOURCES</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Propositional logic: <a href="https://en.wikipedia.org/wiki/Propositional_calculus">https://en.wikipedia.org/wiki/Propositional_calculus</a></li>
<li>Hoare logic: <a href="https://en.wikipedia.org/wiki/Hoare_logic">https://en.wikipedia.org/wiki/Hoare_logic</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org45dae7a" class="outline-2">
<h2 id="org45dae7a"><span class="section-number-2">4.</span> Module 10 Learning Unit 0 – Motivation (MLO 1) [~15 mins]</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Previously we have look at program specifications that involve pre and post conditions and  <b>manually</b> reason that the program implementation is correct (adheres to) with respect to the specification.</li>
<li>As we also have experienced, such manual reasoning is difficult, time consuming, and error-prone, even for short "toy" examples shown class.</li>
<li>Automatic testing is popular and widely-used, however not adequate for many domains and situations such as avionic systems and medical systems</li>
<li>Automatic verification is what required, and has enjoyed many successes in the real-world. For examples,
<ul class="org-ul">
<li>Hardware (e.g., circuit designs, CPU) are rigorous verified by chip makers</li>
<li>Companies and government organizations develop and rely on verification tools (e.g., Mars Rover, Avionic system of Airbus, Facebook newsfeeds and instagrams, Microsoft drivers are all verified in some ways).</li>
</ul></li>

<li>Today we will learn about Hoare Logic, one of the most popular ways to *automatically verify program correctness.</li>
<li>Hoare logic:
<ul class="org-ul">
<li>a formal systems with a set of rules to formally reason about the correctness of a program with respect to given specifications</li>
<li>invited by Sir. Tony Hoare, who is the Turing award winner in 1980 , and in addition to Hoare logic, has developed many well-known concepts such as the *quicksort algorithm and "null pointer" (the billion dollar mistake)</li>
<li>standard for many practical verification techniques and tools</li>
</ul></li>
</ul>

<p>
For this topic, you will learn about
</p>
<ul class="org-ul">
<li>Hoare tripple: which describes how the program changes its states during execution</li>
<li>Total vs. Partial correctness: Total correctness reasons both about program termination (e.g., the loop will eventually terminate) and that the program is correct and satisfies the postcondition when it terminates; whereas parial correctness *assumes the program terminates and only deals with program correctness.</li>
<li>Computing Weakenst Preconditions using Hoare rules: a set of rules for each types of statements in a program that leads to the weakest preconditions required for verification</li>
<li>Finding and using Loop invariants: the crucial piece of information that the user needs to provide to enable verification automation under Hoare logic</li>
<li>Formulating specifications, weakest preconditions, loop invariants as logical formulae</li>
<li>Using SAT solver to automatically prove program correctness</li>
</ul>
</div>
</div>



<div id="outline-container-orgc9cb43a" class="outline-2">
<h2 id="orgc9cb43a"><span class="section-number-2">5.</span> <span class="todo TODO">TODO</span> Module 10 Learning Unit 1 – Intro to Logic (MLO 2) [~1 hour]</h2>
<div class="outline-text-2" id="text-5">
</div>
