docs/wiley/modules/m14/contents.org
** Terminology 
  - variables:
    - boolean variables: can take either True (1) or False (0) value
    - integer variables: can take integers
    - ...

  - Logical connectors: =and= (~&~), =or= (~|~), =not= (~!~), =imply= (~=>~)

  - Formulae: proper combination of variables and logical connectors. 
    #+begin_src
    x
    x & !x
    (x | y) & z
    x => y

    x > 6 and x < 5    :  False  (no value of x would satisfy this)
    x > 6  =>  x > 1   :  True  (every value of x would satisfy this)
    x > 6  and  y = 3  :  False (counterxample: {x=5 , y=2})
    x > 6  =>  y = 3   :  False (counterexample  : {x=7,  y=4})
    #+end_src

 - Satisfiable, Valid (Tautology), Falsification
    - a formula ~f~ is *satisfiable  if there is *some assignment to the values in ~f~ that makes ~f~ evaluate to ~True~
      #+begin_src 
      - x <= 6 or y = 3  is satisfiable (e.g.,  x=4, y=4)
      - x > 6  and  y = 3 is SAT (e.g.,  x =7, y=3)  
      - x > 6  =>  x > 1   is SAT (e.g.,  x=7)
      - x > 6 and x < 5   is UNSAT
      #+end_src
    - a formula ~f~ is *valid if ~f~ is always satisfiable for *every assignment
      #+begin_src 
      x > 6  =>  x > 1   is valid
      x = x  is valid 
      #+end_src
    - a formula ~f~ is a *falsification if ~f~ is always unsatisfiable for *every assignment
      #+begin_src 
      x > 6 and x < 5
      x != x
      x = x + 1   (if x = some infinite number, then x = x + 1 would True, so assume x is finite)
      #+end_src
    

** Important Concept: Formula evaluation
   - Understand how logical connector works, especially *implication*
   - Understand well how to evaluate formula through the above definitions of satisfiable, valid, falsification.
   
** Instructor Screencast: TITLE
Link to MP4 File
** Interactive Element: TITLE  
** Important Concept: Text 
Text. 
** Instructor Screencast: TITLE 
Link to MP4 File 
** Important Concept: Text 
Text.

* Learning Unit 2 – Program Verification using Hoare logic (MLO 2, 3, 4) [~3 hours] 

** Terminology 
*** Hoare Tripple ~{P} S {Q}~
*** Partial and Total Correctness
    - *Partial*: assume ~P~ holds and ~S~ /successfully/ executes, ~Q~ holds
      - Here, we *assume ~P~ and the program terminates (~S~ successfully executed)
    - *Total*: assume ~P~ holds, if  ~S~ /successfully/ executes, then ~Q~ holds
      - Here, we *require ~S~ terminates
      - Dififcult because having to ensure the termination of ~S~
*** Examples of Hoare Tripples
   - Consider a program ~S~ with a single assignment statement ~x:=5~.
     The Hoare tripple ~{True} x := 5 {x > 6}~ is /not/ a valid tripple, but these next ones are
     #+begin_src 
     {True} x := 5 {x=5 or x= 6 or x > 6}
     {True} x := 5 {x > 1}
     {True} x := 5 {x = 5}
     #+end_src
     Moreover, the postcondition in ~x=5~ is *strongest because it is more precise than ~x > 1~ and ~(x=5 or x=6 or x > 6)~.  In general we want the strongest (most precise) postcondition.

   - Consider another program ~z:= x/y~
     These are valid Hoare tripples:
     #+begin_src 
     {x = 1 & y = 2} z:= x/y  {z < 1}
     {x = 2 & y = 4} z:= x/y {z <1}
     {0 < x < y & y != 0} z:= x/y {z <1}
     #+end_src    
     Moreover, the precondition ~0 < x < y & y != 0~ is the *weakest precondition (i.e., it is the least constraint precondition). In general we want the weakest precondition.

   - These are invalid tripples:
     #+begin_src 
     1. {x < y} z:= x/y  {z < 1} (counterexample input x=-1, y=0,  after executing z:=x/y, we do not have z < 1 and instead got a div-by-0 exception)
     {x = 0} z:= x/y  {z < 1} (counterexample input x=0, y=0)
     {y != 0} z:= x/y  {z < 1} (counterexample input x=2 , y=1)
     {x < y & y != 0} z:= x/y {z <1} (counterexample input   x=-2,  y=-1)
     #+end_src


** Important Concept: Text

** Rules to Computing Weakest Preconditions
We can automatically verify (partial) program correctness using Hoare Triples and weakest preconditions.
To prove ~{P} S {Q}~ is valid, i.e., to prove the program ~S~ is correct wrt to the precondition ~P~ and postcondition ~Q~, we check that ~P => wp(S, Q)~ is valid. Here, the function *wp returns the weakest precondition allowing the program ~S~ to achieve the postcondition ~Q~.

Thus, to show the validity of ~{P} S {Q}~, we show that ~P~ implies (~=>~) the WP of ~S~ wrt to ~Q~. Hoare defines rules to obtain the WP of different kind of (imperative) program statements as shown below.
*** Quick summary of Hoare rules


|           Statement |          ~S~           |                 ~wp(S, Q)~                 | Comment                                                                  |
|                 <r> |          <c>           |                    <c>                     | <l>                                                                      |
|          [[ASSIGNMENT][Assignment]] |        ~x := E~        |                  ~Q[x/E]~                  | replace all occurences of the variable ~x~ in ~Q~ with the expresion ~E~ |
| [[#list][List of Assignments]] |        ~S1;S2~         |             ~wp(S1, wp(S2,Q))~             |                                                                          |
|         [[CONDITIONAL][Conditional]] | ~if b then S1 else S2~ |      ~b => wp(S1,Q) & !b => wp(S2,Q)~      |                                                                          |
|                [[LOOP][Loop]] |     ~while b do S~     | ~(I) & (I & B => wp(S,I)) & (I & !B => Q)~ | ~I~ is a user supplied _loop invariant_                                  |
|---------------------+------------------------+--------------------------------------------+--------------------------------------------------------------------------|

