docs/wiley/modules/m14/hoare/contents.html
<div id="outline-container-orgde5bddd" class="outline-3">
<h3 id="orgde5bddd"><span class="section-number-3">5.1.</span> Terminology</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>variables:
<ul class="org-ul">
<li>boolean variables: can take either True (1) or False (0) value</li>
<li>integer variables: can take integers</li>
<li>&#x2026;</li>
</ul></li>

<li>Logical connectors: <code>and</code> (<code>&amp;</code>), <code>or</code> (<code>|</code>), <code>not</code> (<code>!</code>), <code>imply</code> (<code>=&gt;</code>)</li>

<li><p>
Formulae: proper combination of variables and logical connectors. 
</p>
<pre class="example">
x
x &amp; !x
(x | y) &amp; z
x =&gt; y

x &gt; 6 and x &lt; 5    :  False  (no value of x would satisfy this)
x &gt; 6  =&gt;  x &gt; 1   :  True  (every value of x would satisfy this)
x &gt; 6  and  y = 3  :  False (counterxample: {x=5 , y=2})
x &gt; 6  =&gt;  y = 3   :  False (counterexample  : {x=7,  y=4})
</pre></li>
</ul>
<ul class="org-ul">
<li>Satisfiable, Valid (Tautology), Falsification
<ul class="org-ul">
<li><p>
a formula <code>f</code> is *satisfiable  if there is *some assignment to the values in <code>f</code> that makes <code>f</code> evaluate to <code>True</code>
</p>
<pre class="example">
- x &lt;= 6 or y = 3  is satisfiable (e.g.,  x=4, y=4)
- x &gt; 6  and  y = 3 is SAT (e.g.,  x =7, y=3)  
- x &gt; 6  =&gt;  x &gt; 1   is SAT (e.g.,  x=7)
- x &gt; 6 and x &lt; 5   is UNSAT
</pre></li>
<li><p>
a formula <code>f</code> is *valid if <code>f</code> is always satisfiable for *every assignment
</p>
<pre class="example">
x &gt; 6  =&gt;  x &gt; 1   is valid
x = x  is valid 
</pre></li>
<li><p>
a formula <code>f</code> is a *falsification if <code>f</code> is always unsatisfiable for *every assignment
</p>
<pre class="example">
x &gt; 6 and x &lt; 5
x != x
x = x + 1   (if x = some infinite number, then x = x + 1 would True, so assume x is finite)
</pre></li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orga679939" class="outline-3">
<h3 id="orga679939"><span class="section-number-3">5.2.</span> Important Concept: Formula evaluation</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Understand how logical connector works, especially <b>implication</b></li>
<li>Understand well how to evaluate formula through the above definitions of satisfiable, valid, falsification.</li>
</ul>
</div>
</div>

<div id="outline-container-org47fe5dc" class="outline-3">
<h3 id="org47fe5dc"><span class="section-number-3">5.3.</span> Instructor Screencast: TITLE</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Link to MP4 File
</p>
</div>
</div>
<div id="outline-container-orgb4f167f" class="outline-3">
<h3 id="orgb4f167f"><span class="section-number-3">5.4.</span> Interactive Element: TITLE</h3>
</div>
<div id="outline-container-org7fb156d" class="outline-3">
<h3 id="org7fb156d"><span class="section-number-3">5.5.</span> Important Concept: Text</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Text. 
</p>
</div>
</div>
<div id="outline-container-org944bb33" class="outline-3">
<h3 id="org944bb33"><span class="section-number-3">5.6.</span> Instructor Screencast: TITLE</h3>
<div class="outline-text-3" id="text-5-6">
<p>
Link to MP4 File 
</p>
</div>
</div>
<div id="outline-container-org381d961" class="outline-3">
<h3 id="org381d961"><span class="section-number-3">5.7.</span> Important Concept: Text</h3>
<div class="outline-text-3" id="text-5-7">
<p>
Text.
</p>
</div>
</div>
</div>

<div id="outline-container-org3d7d499" class="outline-2">
<h2 id="org3d7d499"><span class="section-number-2">6.</span> Module 10 Learning Unit 2 – Program Verification using Hoare logic (MLO 2, 3) [~3 hours]</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org029400a" class="outline-3">
<h3 id="org029400a"><span class="section-number-3">6.1.</span> Terminology</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgc1c7010" class="outline-4">
<h4 id="orgc1c7010"><span class="section-number-4">6.1.1.</span> Hoare Tripple <code>{P} S {Q}</code></h4>
</div>
<div id="outline-container-org5efc9b8" class="outline-4">
<h4 id="org5efc9b8"><span class="section-number-4">6.1.2.</span> Partial and Total Correctness</h4>
<div class="outline-text-4" id="text-6-1-2">
<ul class="org-ul">
<li><b>Partial</b>: assume <code>P</code> holds and <code>S</code> <i>successfully</i> executes, <code>Q</code> holds
<ul class="org-ul">
<li>Here, we *assume <code>P</code> and the program terminates (<code>S</code> successfully executed)</li>
</ul></li>
<li><b>Total</b>: assume <code>P</code> holds, if  <code>S</code> <i>successfully</i> executes, then <code>Q</code> holds
<ul class="org-ul">
<li>Here, we *require <code>S</code> terminates</li>
<li>Dififcult because having to ensure the termination of <code>S</code></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5cdcc58" class="outline-4">
<h4 id="org5cdcc58"><span class="section-number-4">6.1.3.</span> Examples of Hoare Tripples</h4>
<div class="outline-text-4" id="text-6-1-3">
<ul class="org-ul">
<li><p>
Consider a program <code>S</code> with a single assignment statement <code>x:=5</code>.
The Hoare tripple <code>{True} x := 5 {x &gt; 6}</code> is <i>not</i> a valid tripple, but these next ones are
</p>
<pre class="example">
{True} x := 5 {x=5 or x= 6 or x &gt; 6}
{True} x := 5 {x &gt; 1}
{True} x := 5 {x = 5}
</pre>
<p>
Moreover, the postcondition in <code>x=5</code> is *strongest because it is more precise than <code>x &gt; 1</code> and <code>(x=5 or x=6 or x &gt; 6)</code>.  In general we want the strongest (most precise) postcondition.
</p></li>

<li><p>
Consider another program <code>z:= x/y</code>
These are valid Hoare tripples:
</p>
<pre class="example">
{x = 1 &amp; y = 2} z:= x/y  {z &lt; 1}
{x = 2 &amp; y = 4} z:= x/y {z &lt;1}
{0 &lt; x &lt; y &amp; y != 0} z:= x/y {z &lt;1}
</pre>
<p>
Moreover, the precondition <code>0 &lt; x &lt; y &amp; y != 0</code> is the *weakest precondition (i.e., it is the least constraint precondition). In general we want the weakest precondition.
</p></li>

<li><p>
These are invalid tripples:
</p>
<pre class="example">
1. {x &lt; y} z:= x/y  {z &lt; 1} (counterexample input x=-1, y=0,  after executing z:=x/y, we do not have z &lt; 1 and instead got a div-by-0 exception)
{x = 0} z:= x/y  {z &lt; 1} (counterexample input x=0, y=0)
{y != 0} z:= x/y  {z &lt; 1} (counterexample input x=2 , y=1)
{x &lt; y &amp; y != 0} z:= x/y {z &lt;1} (counterexample input   x=-2,  y=-1)
</pre></li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-orgcc366ce" class="outline-2">
<h2 id="orgcc366ce"><span class="section-number-2">7.</span> Important Concept: Text</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org9f81eaf" class="outline-3">
<h3 id="org9f81eaf"><span class="section-number-3">7.1.</span> Rules to Computing Weakest Preconditions</h3>
<div class="outline-text-3" id="text-7-1">
<p>
We can automatically verify (partial) program correctness using Hoare Triples and weakest preconditions.
To prove <code>{P} S {Q}</code> is valid, i.e., to prove the program <code>S</code> is correct wrt to the precondition <code>P</code> and postcondition <code>Q</code>, we check that <code>P =&gt; wp(S, Q)</code> is valid. Here, the function *wp returns the weakest precondition allowing the program <code>S</code> to achieve the postcondition <code>Q</code>.
</p>

<p>
Thus, to show the validity of <code>{P} S {Q}</code>, we show that <code>P</code> implies (<code>=&gt;</code>) the WP of <code>S</code> wrt to <code>Q</code>. Hoare defines rules to obtain the WP of different kind of (imperative) program statements as shown below.
</p>
</div>
<div id="outline-container-org0f7cff1" class="outline-4">
<h4 id="org0f7cff1"><span class="section-number-4">7.1.1.</span> Quick summary of Hoare rules</h4>
<div class="outline-text-4" id="text-7-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-center" />

<col  class="org-center" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Statement</td>
<td class="org-center"><code>S</code></td>
<td class="org-center"><code>wp(S, Q)</code></td>
<td class="org-left">Comment</td>
</tr>

<tr>
<td class="org-right"><a href="#org35fe055">Assignment</a></td>
<td class="org-center"><code>x := E</code></td>
<td class="org-center"><code>Q[x/E]</code></td>
<td class="org-left">replace all occurences of the variable <code>x</code> in <code>Q</code> with the expresion <code>E</code></td>
</tr>

<tr>
<td class="org-right"><a href="#list">List of Assignments</a></td>
<td class="org-center"><code>S1;S2</code></td>
<td class="org-center"><code>wp(S1, wp(S2,Q))</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right"><a href="#org1151d39">Conditional</a></td>
<td class="org-center"><code>if b then S1 else S2</code></td>
<td class="org-center"><code>b =&gt; wp(S1,Q) &amp; !b =&gt; wp(S2,Q)</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right"><a href="#org079ed0a">Loop</a></td>
<td class="org-center"><code>while b do S</code></td>
<td class="org-center"><code>(I) &amp; (I &amp; B =&gt; wp(S,I)) &amp; (I &amp; !B =&gt; Q)</code></td>
<td class="org-left"><code>I</code> is a user supplied <span class="underline">loop invariant</span></td>
</tr>
</tbody>
</table>
</div>
</div>
