docs/wiley/modules/m14/contents.org
*** ASSIGNMENT
An ~assignment~ statement ~x := E~ is one of the most popular types of statement.  It assigns the value of an expression ~E~ to a variable ~x~. The WP for an assignment ~wp(x:=E,Q)~ is obtained by substituting all occurences of ~x~ in ~Q~ with the expression ~E~.

#+begin_src 
WP(x := E, Q) = Q[x/E]
#+end_src

Example:
#+begin_src 
WP(x:=3, x + y = 10)
= 3 + y = 10 
= y = 7
Thus, we have {y=7} x := 3 {x + y = 10}
#+end_src

#+begin_src 
WP(x:=3, {x + y > 0) 
= 3 + y > 0  
= y > -3
Thus, we have {y > -3}  x := 3 {x + y> 0}
#+end_src

*** LIST of statements
   :PROPERTIES:
   :CUSTOM_ID: list
   :END:
   
A list of sequential statements. The WP for list is defined /recursively/ as follows.

#+begin_src
WP([S1; S2; S3 ...;]  Q) = WP(S1, WP(S2;S3;.., Q))
WP([], Q) = Q
#+end_src

Example:
#+begin_src 
WP([x:=x+1; y:=y*x], y=2*z) 
=   WP(x:=x+1, WP([y:=y*x], y=2*z))
=   WP(x:=x+1, y*x=2*z)
=   y*(x+1)=2*z
Thus, we have {y*(x+1)=2*z}  x:=x+1; y:=y*x {y=2*z}
#+end_src

*** CONDITIONAL

The WP of a conditional statement ~if b then S1 else S2, Q~ combines the WPs of ~S1~ and ~S2~.

#+begin_src 
  WP(if b then S1 else S2, Q)  =  (b => WP(S1,Q))  &  (!b => WP(S2, Q))
#+end_src

Example:
#+begin_src
WP(if x > 0 then y := x + 2  else y := y + 1,  y > x) 
= (x>0 => WP(y:=y+x, y>x) & (x<=0 => WP(y:=y+1, y>x))
= (x>0 => y+x>x)  &  (x <= 0  =>  y+1>x)
= x>0 => y>0  & x<=0 => y+1>x
#+end_src

#+begin_src
  WP(if x > 0 then y :=x  else y:= 0,  y > 0) 
  = (x>0 => WP(y:=x, y >0)) & (x<=0 => WP(y:=0, y>0))
  = (x > 0 => x > 0)  &  (x <= 0  =>  0 > 0)
  = True & x > 0   
  = x > 0 # (0> 0 is false,  and so !(x<=0) or false is !(x<=0) = x>0)
#+end_src
  
Note: Instead of using ~=>~ (imply), which might be confusing to some, we can use just ~!~ (not) and ~||~ (or)
#+begin_src 
WP(if b then S1 else S2, Q)
=  (b => WP(S1,Q))  &  (!b => WP(S2, Q))
=  !((b & !WP(S1,Q))  ||  (!b & !WP(S2, Q)))
#+end_src

** Important Concept: Loop Invariants
*** Loop Invariants
At a high level, loop invariant capture the meaning of the loop, and thus help understand and reason about the loop. They are especially helpful for automatic verification.

A loop invariant is a property ~I~ that always holds at the *loop entrance*. This means that ~I~  (i) holds when the loop entered and (ii) is preserved after the loop body is executed (i.e., ~I~ is an inductive loop invariant).

*** Where is the loop invariant ~I~?

If you have a loop that looks like
#+begin_src
while (b){
  // I 
  //loop body
}
#+end_src

It is useful to transform it to this equivalent form
#+begin_src c
while (True){
  // [I] : loop invariant I is right here
  if (!b) break
  //loop body
}
#+end_src

Then the loop invariant ~I~ is right when you enter the loop, as indicated by ~[I]~ in the code above.

Note that ~I~ is not located *after the guard condition ~b~ is satisfied, e.g., 
#+begin_src c
while (b){
  //[I]  : incorrect location for loop invariant
  //loop body
}
#+end_src


*** What is the loop invariant ~I~?
:PROPERTIES:
:CUSTOM_ID: li
:END:


We will use an example to demonstrate loop invariants. Consider a simple program

#+begin_src c
  // {N >= 0} 
  i := 0;
  while(i < N){
    i := N;
  }
  // {i = N} // post condition
#+end_src

To make it easier to see where loop invariants are, we first transform this program into an equivalent one:

#+begin_src c
  // {N >= 0} 
  i := 0;
  while(true){
    // [I]: loop invariants here
    if(!i < N) break;
    i := N;
  }
  // {i = N} // post condition
#+end_src


The ~while~ loop in this program has many possible loop invariants (any property that is true at ~[I]~):
1. ~true~ : is always a loop invariant, but it is very weak and trivial, i.e., almost useless for any analysis
1. ~N >= 0~:  because ~N>0~ is a precondition and ~N~ is never changed
1. ~i>=0~: because ~i~ is initalized to ~0~ can only changed to ~N~, which itself is ~>=0~ and never changed.
1. ~i <= N~: because ~i~ can only either be ~0~ or ~N~, and ~N >=0~.

*** Which loop invariants to use?
:PROPERTIES:
:CUSTOM_ID: li-to-use
:END:

An important question to ask is which of these invariants are useful?  Typically, the more stronger the better as they capture the meaning of the loop more precisely (thus ~true~ is not very useful).  However, the answer really depends on the task we are trying to achieve.  If the task is to prove a very weak property, then we might not need strong loop invariants, e.g., for instance to prove that ~N >= 0~ as the postcondition, then we only need the loop invariant ~N >= 0~.  Vice versa, if the task is to prove a strong property such as ~i=N~, then we likely need strong loop invariants, e.g., ~i<=N~.

In many cases, we can guess which loop invariants are useful based on the postconditions we want to prove. However, in the general cases we do not know a priori which loop invariants to use.  If the program is indeed correct wrt the specs (i.e., the representing Hoare tripple is valid), there are two possible scenarios about using loop invariants to prove programs:
1. if we use sufficiently strong loop invariants, then we will be able to prove the program is correct.
1. if we use insufficiently strong loop invariants, then we will /not/ be able to prove the program is correct.  
The [[LOOP][loop]] section in Hoare logic gives concrete examples demonstrating these two cases.

Thus, this gives an *crucial observation:  if we can prove that a program is correct (e.g., using Hoare logic), then it is really correct.  However, if we cannot prove that the program is correct, then we do not know whether the program is correct or not (it could really be wrong,  or it is actually correct but we can't prove it because we use rather weak loop invariants).




*** Important Concept: Computing WP for LOOPs

