docs/wiley/modules/m14/hoare/contents.html

<div id="outline-container-org35fe055" class="outline-4">
<h4 id="org35fe055"><span class="section-number-4">7.1.2.</span> ASSIGNMENT</h4>
<div class="outline-text-4" id="text-7-1-2">
<p>
An <code>assignment</code> statement <code>x := E</code> is one of the most popular types of statement.  It assigns the value of an expression <code>E</code> to a variable <code>x</code>. The WP for an assignment <code>wp(x:=E,Q)</code> is obtained by substituting all occurences of <code>x</code> in <code>Q</code> with the expression <code>E</code>.
</p>

<pre class="example">
WP(x := E, Q) = Q[x/E]
</pre>

<p>
Example:
</p>
<pre class="example">
WP(x:=3, x + y = 10)
= 3 + y = 10 
= y = 7
Thus, we have {y=7} x := 3 {x + y = 10}
</pre>

<pre class="example">
WP(x:=3, {x + y &gt; 0) 
= 3 + y &gt; 0  
= y &gt; -3
Thus, we have {y &gt; -3}  x := 3 {x + y&gt; 0}
</pre>
</div>
</div>

<div id="outline-container-list" class="outline-4">
<h4 id="list"><span class="section-number-4">7.1.3.</span> LIST of statements</h4>
<div class="outline-text-4" id="text-list">
<p>
A list of sequential statements. The WP for list is defined <i>recursively</i> as follows.
</p>

<pre class="example">
WP([S1; S2; S3 ...;]  Q) = WP(S1, WP(S2;S3;.., Q))
WP([], Q) = Q
</pre>

<p>
Example:
</p>
<pre class="example">
WP([x:=x+1; y:=y*x], y=2*z) 
=   WP(x:=x+1, WP([y:=y*x], y=2*z))
=   WP(x:=x+1, y*x=2*z)
=   y*(x+1)=2*z
Thus, we have {y*(x+1)=2*z}  x:=x+1; y:=y*x {y=2*z}
</pre>
</div>
</div>

<div id="outline-container-org1151d39" class="outline-4">
<h4 id="org1151d39"><span class="section-number-4">7.1.4.</span> CONDITIONAL</h4>
<div class="outline-text-4" id="text-7-1-4">
<p>
The WP of a conditional statement <code>if b then S1 else S2, Q</code> combines the WPs of <code>S1</code> and <code>S2</code>.
</p>

<pre class="example">
WP(if b then S1 else S2, Q)  =  (b =&gt; WP(S1,Q))  &amp;  (!b =&gt; WP(S2, Q))
</pre>

<p>
Example:
</p>
<pre class="example">
WP(if x &gt; 0 then y := x + 2  else y := y + 1,  y &gt; x) 
= (x&gt;0 =&gt; WP(y:=y+x, y&gt;x) &amp; (x&lt;=0 =&gt; WP(y:=y+1, y&gt;x))
= (x&gt;0 =&gt; y+x&gt;x)  &amp;  (x &lt;= 0  =&gt;  y+1&gt;x)
= x&gt;0 =&gt; y&gt;0  &amp; x&lt;=0 =&gt; y+1&gt;x
</pre>

<pre class="example">
WP(if x &gt; 0 then y :=x  else y:= 0,  y &gt; 0) 
= (x&gt;0 =&gt; WP(y:=x, y &gt;0)) &amp; (x&lt;=0 =&gt; WP(y:=0, y&gt;0))
= (x &gt; 0 =&gt; x &gt; 0)  &amp;  (x &lt;= 0  =&gt;  0 &gt; 0)
= True &amp; x &gt; 0   
= x &gt; 0 # (0&gt; 0 is false,  and so !(x&lt;=0) or false is !(x&lt;=0) = x&gt;0)
</pre>

<p>
Note: Instead of using <code>=&gt;</code> (imply), which might be confusing to some, we can use just <code>!</code> (not) and <code>||</code> (or)
</p>
<pre class="example">
WP(if b then S1 else S2, Q)
=  (b =&gt; WP(S1,Q))  &amp;  (!b =&gt; WP(S2, Q))
=  !((b &amp; !WP(S1,Q))  ||  (!b &amp; !WP(S2, Q)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d7bb13" class="outline-3">
<h3 id="org5d7bb13"><span class="section-number-3">7.2.</span> Important Concept: Loop Invariants</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-org162e01a" class="outline-4">
<h4 id="org162e01a"><span class="section-number-4">7.2.1.</span> Loop Invariants</h4>
<div class="outline-text-4" id="text-7-2-1">
<p>
At a high level, loop invariant capture the meaning of the loop, and thus help understand and reason about the loop. They are especially helpful for automatic verification.
</p>

<p>
A loop invariant is a property <code>I</code> that always holds at the <b>loop entrance</b>. This means that <code>I</code>  (i) holds when the loop entered and (ii) is preserved after the loop body is executed (i.e., <code>I</code> is an inductive loop invariant).
</p>
</div>
</div>

<div id="outline-container-org14a66bd" class="outline-4">
<h4 id="org14a66bd"><span class="section-number-4">7.2.2.</span> Where is the loop invariant <code>I</code>?</h4>
<div class="outline-text-4" id="text-7-2-2">
<p>
If you have a loop that looks like
</p>
<pre class="example">
while (b){
  // I 
  //loop body
}
</pre>

<p>
It is useful to transform it to this equivalent form
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #e45649;">while</span> (True){
  <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">[I] : loop invariant I is right here</span>
  <span style="color: #e45649;">if</span> (<span style="color: #4078f2; font-weight: bold;">!</span>b) <span style="color: #e45649;">break</span>
  <span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">loop body</span>
}
</pre>
</div>

<p>
Then the loop invariant <code>I</code> is right when you enter the loop, as indicated by <code>[I]</code> in the code above.
</p>

<p>
Note that <code>I</code> is not located *after the guard condition <code>b</code> is satisfied, e.g., 
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #e45649;">while</span> (b){
  <span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">[I]  : incorrect location for loop invariant</span>
  <span style="color: #9ca0a4;">//</span><span style="color: #9ca0a4;">loop body</span>
}
</pre>
</div>
</div>
</div>


<div id="outline-container-li" class="outline-4">
<h4 id="li"><span class="section-number-4">7.2.3.</span> What is the loop invariant <code>I</code>?</h4>
<div class="outline-text-4" id="text-li">
<p>
We will use an example to demonstrate loop invariants. Consider a simple program
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{N &gt;= 0} </span>
i := 0;
<span style="color: #e45649;">while</span>(i &lt; N){
  <span style="color: #b751b6;">i</span> := N;
}
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{i = N} // post condition</span>
</pre>
</div>

<p>
To make it easier to see where loop invariants are, we first transform this program into an equivalent one:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{N &gt;= 0} </span>
i := 0;
<span style="color: #e45649;">while</span>(<span style="color: #b751b6;">true</span>){
  <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">[I]: loop invariants here</span>
  <span style="color: #e45649;">if</span>(<span style="color: #4078f2; font-weight: bold;">!</span>i &lt; N) <span style="color: #e45649;">break</span>;
  <span style="color: #b751b6;">i</span> := N;
}
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{i = N} // post condition</span>
</pre>
</div>


<p>
The <code>while</code> loop in this program has many possible loop invariants (any property that is true at <code>[I]</code>):
</p>
<ol class="org-ol">
<li><code>true</code> : is always a loop invariant, but it is very weak and trivial, i.e., almost useless for any analysis</li>
<li><code>N &gt;= 0</code>:  because <code>N&gt;0</code> is a precondition and <code>N</code> is never changed</li>
<li><code>i&gt;=0</code>: because <code>i</code> is initalized to <code>0</code> can only changed to <code>N</code>, which itself is <code>&gt;=0</code> and never changed.</li>
<li><code>i &lt;= N</code>: because <code>i</code> can only either be <code>0</code> or <code>N</code>, and <code>N &gt;=0</code>.</li>
</ol>
</div>
</div>

<div id="outline-container-li-to-use" class="outline-4">
<h4 id="li-to-use"><span class="section-number-4">7.2.4.</span> Which loop invariants to use?</h4>
<div class="outline-text-4" id="text-li-to-use">
<p>
An important question to ask is which of these invariants are useful?  Typically, the more stronger the better as they capture the meaning of the loop more precisely (thus <code>true</code> is not very useful).  However, the answer really depends on the task we are trying to achieve.  If the task is to prove a very weak property, then we might not need strong loop invariants, e.g., for instance to prove that <code>N &gt;= 0</code> as the postcondition, then we only need the loop invariant <code>N &gt;= 0</code>.  Vice versa, if the task is to prove a strong property such as <code>i=N</code>, then we likely need strong loop invariants, e.g., <code>i&lt;=N</code>.
</p>

<p>
In many cases, we can guess which loop invariants are useful based on the postconditions we want to prove. However, in the general cases we do not know a priori which loop invariants to use.  If the program is indeed correct wrt the specs (i.e., the representing Hoare tripple is valid), there are two possible scenarios about using loop invariants to prove programs:
</p>
<ol class="org-ol">
<li>if we use sufficiently strong loop invariants, then we will be able to prove the program is correct.</li>
<li>if we use insufficiently strong loop invariants, then we will <i>not</i> be able to prove the program is correct.</li>
</ol>
<p>
The <a href="#org079ed0a">loop</a> section in Hoare logic gives concrete examples demonstrating these two cases.
</p>

<p>
Thus, this gives an *crucial observation:  if we can prove that a program is correct (e.g., using Hoare logic), then it is really correct.  However, if we cannot prove that the program is correct, then we do not know whether the program is correct or not (it could really be wrong,  or it is actually correct but we can't prove it because we use rather weak loop invariants).
</p>
</div>
</div>




<div id="outline-container-org897751f" class="outline-4">
<h4 id="org897751f"><span class="section-number-4">7.2.5.</span> Important Concept: Computing WP for LOOPs</h4>
<div class="outline-text-4" id="text-7-2-5">
</div>
<ol class="org-ol">
