docs/wiley/modules/m14/contents.org
**** LOOP
Unlike other statements where we have rules to compute WP automatically, for loop, we (the user) need to supply a /loop invariant/ ~I~to obtain the WP of loop. This [[Loop Invariants][subsection]] describes loop invariants.  The WP for loop is:

#+begin_src 
  WP(while [I] b do S, Q) =  I & (I & b => WP(S,I) & (I & !b)  => Q)
#+end_src
As can be seen, the WP for loop consists of 3 conjuncts:
  1. ~I~ :  the loop invariant (should hold when entering the loop)
  1. ~(I & b)  =>   I~ : (entering the loop because ~b~ is true) ~I~ is preserved after each loop body execution 
  1. ~(I & !b) =>  Q~  (exiting the loop because ~b~ is false), when exiting the loop, the post condition holds  

Thus, to compute WP for loop, you would need to come up with invariants. Moreover, as [[Loop Invariants][mentioned]], we will need to pick a sufficiently strong loop invariants to be able to prove the program. Note that we will always able to create the weakest WP, but it might not be good enough to prove the program at the end.

Below we demonstrate the computation of WPs using sufficiently and insufficiently strong invariants. We use the same example program used [[#li][here]]:
#+begin_src c
  // {N >= 0} 
  i := 0;
  while(true){
    // [I]: loop invariants here
    if(!i < N) break;
    i := N;
  }
  // {i = N} // post condition
#+end_src

This program has several loop invariants at ~[I]~ including  ~N >= 0, i>=0, i <= N~.  Also, the program can be written as ~S: i := 0; while[i<=N] i < N do i:= N]~, with precondition ~P: N >= 0~ and postcondition ~Q: i==N~.

**** Example: using a /sufficiently/ strong invariant
Here, we use the loop invariant ~i <= N~ to prove ~S~ is correct wrt to ~P,Q~. As we will see, this loop invariant is sufficiently strong because it allows us to prove the program.
1. Apply the WP to the program, which is a list of statements.
   #+begin_src
   WP([i := 0; while[i<=N] i < N do i:= N], i = N) 
   = WP(i := 0; WP(while[i<=N] i < N do i:=N], i = N)  //WP rule for list of statements
   #+end_src
1. Apply the WP to ~while~ 
   #+begin_src
   // Let's first compute WP(while[i<=N] i < N do i:=N, {i = N}). According to the WP rule for LOOP, we will have 3 conjuncts 
   1. i <= N
 
   2. (i <= N & i < N) => WP(i:=N, {i<=N})
      = i < N          =>  N <= N 
      = i < N          =>  True   
      = True     // because !(i<N) or True  is true (anything or with true is true)
 
   3. (i <= N & !(i<N)) => i = N
      = i = N           => i = N
      = True     // because !(i=N) | i = n  is True (a or !a is True)
 
   =  i <= N & True & True
   =  i <= N
   #+end_src
1. After obtaining the WP ~i<=N~ for ~while~, we continue with ~WP(i:=0, i<=N)~
   #+begin_src 
   // WP([i := 0; while[i<=N] i < N do i:= N], i = N) = WP(i := 0, i<=N)
   WP(i := 0, i<=N)
   = 0<=N  //WP rule for assignment
   #+end_src
1. Now we construct a /verification condition/ (~vc~) to check that the given precondition ~P: N >= 0~ implies the WP ~0<=N~
   #+begin_src 
   P => WP([i := 0; while[i<=N] i < N do i:= N], {i = N}) 
   = N>=0 =>  0<=N   // N>=0 is the given precondition and 0 <= N is the WP we obtain above for the program
   = True
   #+end_src
   Because te given precondition ~N>=0~ implies ~0<=N~, the Hoare tripple is valid, i.e., the program is correct.
1. Also, the loop invariant ~i <= N~ is thus *sufficiently strong to let us prove the program satisfy the specifications.

**** Example 2: using an /insufficiently/ strong invariant
Here, we use the loop invariant ~N >= 0~ to prove program. As we will see, this loop invariant is not sufficiently strong because we will not be able to use it to prove the program.

1. Apply the WP to ~while~
     #+begin_src 
      WP(while[N >= 0] i < N do i:=N, {i = N})
      =
        1. N >= 0
        2. (N >=0 & i < N) => WP(i := N, N >= 0) = 
           (N >=0 & i < N) => i >= 0   // we can't simplify much, so just leave as is

        3. N >=0 & !(i<N) => i =N
           (N >= 0 & i >= N) => i = N
           i>= 0  => i = N  // we can't simplify much, so just leave as is

        =  N >=0 & (N >=0 & i < N) => i >= 0 & (i>= 0  => i = N)

      WP(i:=0; {N >=0 & (N >=0 & i < N) => i >= 0 & (i>= 0  => i = N)})
        = (0 >= 0) & (0 >= 0 & 0 < N => 0 >= 0) & (0>=0 => 0 = N)  //apply WP for assignment and simplify
        =  TRUE    &      TRUE                  & 0 = N
        = 0 = N
      #+end_src
2. Obtain the ~vc~
   #+begin_src 
   P => 0 = N  // the given precondition implies 0 = N
   (N >= 0) => 0 = N  // This is not valid, e.g., counterexample N=3
   #+end_src
   The ~vc~ is not valid and thus we were not able to prove the Hoare triple and hence do not know whether the program is correct or not.
3. Thus this loop invariant is not sufficiently strong for us to prove the program.

   *Important*: as mentioned [[#li-to-use][here]], not being able to prove simply means we cannot prove it using this loop invariant.  It *does not mean that you disprove it or show that the Hoare triple is invalid.  (in fact, we know the Hoare tripple is valid if we used a different loop invariant, e.g., i <= N )


*** Instructor Screencast: TITLE 
Link to MP4 File 
*** Interactive Element: TITLE 
*** Important Concept: Text 
Text. 
*** Instructor Screencast: TITLE 
Link to MP4 File 

* Assignment – Program Verification using Hoare Logic (MLO 2, 3, 4) [~2.5 hours]  
 
** Purpose 
The purpose of this assignment is to help you practice learned concepts on logical formula, Hoare tripple, and especially program verification using Hoare logic.  


** Instructions
*** Q1
   Fill in ~P,S,Q~ to make the following Hoare tripples valid.

1. ~{Q} x:=3 {x = 8}~
 #+begin_comment
 ~Q~ is ~False~. Because the precondition ~False~, i.e., there is no way we can satisfies the precondition in the first place.
 #+end_comment
1. ~{P} x:= y - 3 {x = 8}~
 #+begin_comment   
 ~P~ is ~y = 11~
 #+end_comment      
1. ~{x = y} S {x = y}~
 #+begin_comment   
 ~S~ is ~skip~ (i.e., doesn't do anything)
 #+end_comment
1. ~{x < 0} while(x!=0) do x := x - 1 {Q}~
 #+begin_comment   
 ~Q~ can be any formula. The loop /does not/ terminates so the Hoare tripple is valid no matter what postcondition we use (loop does not terminate violates the assumption of partial correctness).

 Note: this tripple is valid for /partial/ correctness, but is /not/ valid for /total/ correctness.
 #+end_comment

