docs/wiley/modules/m14/hoare/contents.html
<li><a id="org079ed0a"></a>LOOP<br />
<div class="outline-text-5" id="text-7-2-5-1">
<p>
Unlike other statements where we have rules to compute WP automatically, for loop, we (the user) need to supply a <i>loop invariant</i> ~I~to obtain the WP of loop. This <a href="#org162e01a">subsection</a> describes loop invariants.  The WP for loop is:
</p>

<pre class="example">
WP(while [I] b do S, Q) =  I &amp; (I &amp; b =&gt; WP(S,I) &amp; (I &amp; !b)  =&gt; Q)
</pre>
<p>
As can be seen, the WP for loop consists of 3 conjuncts:
</p>
<ol class="org-ol">
<li><code>I</code> :  the loop invariant (should hold when entering the loop)</li>
<li><code>(I &amp; b)  =&gt;   I</code> : (entering the loop because <code>b</code> is true) <code>I</code> is preserved after each loop body execution</li>
<li><code>(I &amp; !b) =&gt;  Q</code>  (exiting the loop because <code>b</code> is false), when exiting the loop, the post condition holds</li>
</ol>

<p>
Thus, to compute WP for loop, you would need to come up with invariants. Moreover, as <a href="#org162e01a">mentioned</a>, we will need to pick a sufficiently strong loop invariants to be able to prove the program. Note that we will always able to create the weakest WP, but it might not be good enough to prove the program at the end.
</p>

<p>
Below we demonstrate the computation of WPs using sufficiently and insufficiently strong invariants. We use the same example program used <a href="#li">here</a>:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{N &gt;= 0} </span>
i := 0;
<span style="color: #e45649;">while</span>(<span style="color: #b751b6;">true</span>){
  <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">[I]: loop invariants here</span>
  <span style="color: #e45649;">if</span>(<span style="color: #4078f2; font-weight: bold;">!</span>i &lt; N) <span style="color: #e45649;">break</span>;
  <span style="color: #b751b6;">i</span> := N;
}
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">{i = N} // post condition</span>
</pre>
</div>

<p>
This program has several loop invariants at <code>[I]</code> including  <code>N &gt;= 0, i&gt;=0, i &lt;= N</code>.  Also, the program can be written as <code>S: i := 0; while[i&lt;=N] i &lt; N do i:= N]</code>, with precondition <code>P: N &gt;= 0</code> and postcondition <code>Q: i==N</code>.
</p>
</div>
</li>

<li><a id="org8b7eee2"></a>Example: using a <i>sufficiently</i> strong invariant<br />
<div class="outline-text-5" id="text-7-2-5-2">
<p>
Here, we use the loop invariant <code>i &lt;= N</code> to prove <code>S</code> is correct wrt to <code>P,Q</code>. As we will see, this loop invariant is sufficiently strong because it allows us to prove the program.
</p>
<ol class="org-ol">
<li><p>
Apply the WP to the program, which is a list of statements.
</p>
<pre class="example">
WP([i := 0; while[i&lt;=N] i &lt; N do i:= N], i = N) 
= WP(i := 0; WP(while[i&lt;=N] i &lt; N do i:=N], i = N)  //WP rule for list of statements
</pre></li>
<li><p>
Apply the WP to <code>while</code> 
</p>
<pre class="example">
// Let's first compute WP(while[i&lt;=N] i &lt; N do i:=N, {i = N}). According to the WP rule for LOOP, we will have 3 conjuncts 
1. i &lt;= N

2. (i &lt;= N &amp; i &lt; N) =&gt; WP(i:=N, {i&lt;=N})
   = i &lt; N          =&gt;  N &lt;= N 
   = i &lt; N          =&gt;  True   
   = True     // because !(i&lt;N) or True  is true (anything or with true is true)

3. (i &lt;= N &amp; !(i&lt;N)) =&gt; i = N
   = i = N           =&gt; i = N
   = True     // because !(i=N) | i = n  is True (a or !a is True)

=  i &lt;= N &amp; True &amp; True
=  i &lt;= N
</pre></li>
<li><p>
After obtaining the WP <code>i&lt;=N</code> for <code>while</code>, we continue with <code>WP(i:=0, i&lt;=N)</code>
</p>
<pre class="example">
// WP([i := 0; while[i&lt;=N] i &lt; N do i:= N], i = N) = WP(i := 0, i&lt;=N)
WP(i := 0, i&lt;=N)
= 0&lt;=N  //WP rule for assignment
</pre></li>
<li><p>
Now we construct a <i>verification condition</i> (<code>vc</code>) to check that the given precondition <code>P: N &gt;= 0</code> implies the WP <code>0&lt;=N</code>
</p>
<pre class="example">
P =&gt; WP([i := 0; while[i&lt;=N] i &lt; N do i:= N], {i = N}) 
= N&gt;=0 =&gt;  0&lt;=N   // N&gt;=0 is the given precondition and 0 &lt;= N is the WP we obtain above for the program
= True
</pre>
<p>
Because te given precondition <code>N&gt;=0</code> implies <code>0&lt;=N</code>, the Hoare tripple is valid, i.e., the program is correct.
</p></li>
<li>Also, the loop invariant <code>i &lt;= N</code> is thus *sufficiently strong to let us prove the program satisfy the specifications.</li>
</ol>
</div>
</li>

<li><a id="orgdc2a371"></a>Example 2: using an <i>insufficiently</i> strong invariant<br />
<div class="outline-text-5" id="text-7-2-5-3">
<p>
Here, we use the loop invariant <code>N &gt;= 0</code> to prove program. As we will see, this loop invariant is not sufficiently strong because we will not be able to use it to prove the program.
</p>

<ol class="org-ol">
<li><p>
Apply the WP to <code>while</code>
</p>
<pre class="example">
WP(while[N &gt;= 0] i &lt; N do i:=N, {i = N})
=
  1. N &gt;= 0
  2. (N &gt;=0 &amp; i &lt; N) =&gt; WP(i := N, N &gt;= 0) = 
     (N &gt;=0 &amp; i &lt; N) =&gt; i &gt;= 0   // we can't simplify much, so just leave as is

  3. N &gt;=0 &amp; !(i&lt;N) =&gt; i =N
     (N &gt;= 0 &amp; i &gt;= N) =&gt; i = N
     i&gt;= 0  =&gt; i = N  // we can't simplify much, so just leave as is

  =  N &gt;=0 &amp; (N &gt;=0 &amp; i &lt; N) =&gt; i &gt;= 0 &amp; (i&gt;= 0  =&gt; i = N)

WP(i:=0; {N &gt;=0 &amp; (N &gt;=0 &amp; i &lt; N) =&gt; i &gt;= 0 &amp; (i&gt;= 0  =&gt; i = N)})
  = (0 &gt;= 0) &amp; (0 &gt;= 0 &amp; 0 &lt; N =&gt; 0 &gt;= 0) &amp; (0&gt;=0 =&gt; 0 = N)  //apply WP for assignment and simplify
  =  TRUE    &amp;      TRUE                  &amp; 0 = N
  = 0 = N
</pre></li>
<li><p>
Obtain the <code>vc</code>
</p>
<pre class="example">
P =&gt; 0 = N  // the given precondition implies 0 = N
(N &gt;= 0) =&gt; 0 = N  // This is not valid, e.g., counterexample N=3
</pre>
<p>
The <code>vc</code> is not valid and thus we were not able to prove the Hoare triple and hence do not know whether the program is correct or not.
</p></li>
<li><p>
Thus this loop invariant is not sufficiently strong for us to prove the program.
</p>

<p>
<b>Important</b>: as mentioned <a href="#li-to-use">here</a>, not being able to prove simply means we cannot prove it using this loop invariant.  It *does not mean that you disprove it or show that the Hoare triple is invalid.  (in fact, we know the Hoare tripple is valid if we used a different loop invariant, e.g., i &lt;= N )
</p></li>
</ol>
</div>
</li>
</ol>
</div>


<div id="outline-container-org4083509" class="outline-4">
<h4 id="org4083509"><span class="section-number-4">7.2.6.</span> Instructor Screencast: TITLE</h4>
<div class="outline-text-4" id="text-7-2-6">
<p>
Link to MP4 File 
</p>
</div>
</div>
<div id="outline-container-org6bda050" class="outline-4">
<h4 id="org6bda050"><span class="section-number-4">7.2.7.</span> Interactive Element: TITLE</h4>
</div>
<div id="outline-container-orgc198ab8" class="outline-4">
<h4 id="orgc198ab8"><span class="section-number-4">7.2.8.</span> Important Concept: Text</h4>
<div class="outline-text-4" id="text-7-2-8">
<p>
Text. 
</p>
</div>
</div>
<div id="outline-container-org710e1c6" class="outline-4">
<h4 id="org710e1c6"><span class="section-number-4">7.2.9.</span> Instructor Screencast: TITLE</h4>
<div class="outline-text-4" id="text-7-2-9">
<p>
Link to MP4 File 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd77001b" class="outline-2">
<h2 id="orgd77001b"><span class="section-number-2">8.</span> Module 10 Assignment – Program Verification using Hoare Logic (MLO TODO, TODO) [~2.5 hours]</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org7750487" class="outline-3">
<h3 id="org7750487"><span class="section-number-3">8.1.</span> Purpose</h3>
<div class="outline-text-3" id="text-8-1">
<p>
The purpose of this assignment is to help you practice learned concepts on logical formula, Hoare tripple, and especially program verification using Hoare logic.  
</p>
</div>
</div>


<div id="outline-container-org6ee912d" class="outline-3">
<h3 id="org6ee912d"><span class="section-number-3">8.2.</span> Instructions</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-org2ab1162" class="outline-4">
<h4 id="org2ab1162"><span class="section-number-4">8.2.1.</span> Q1</h4>
<div class="outline-text-4" id="text-8-2-1">
<p>
Fill in <code>P,S,Q</code> to make the following Hoare tripples valid.
</p>

<ol class="org-ol">
<li><code>{Q} x:=3 {x = 8}</code></li>
<li><code>{P} x:= y - 3 {x = 8}</code></li>
<li><code>{x = y} S {x = y}</code></li>
<li><code>{x &lt; 0} while(x!=0) do x := x - 1 {Q}</code></li>
</ol>
</div>
</div>
